"""
3. Пользователь вводит месяц в виде целого числа от 1 до 12. Сообщить к какому времени года относится месяц
(зима, весна, лето, осень). Напишите решения через list и через dict.
"""

#решение через list
seasons_list = ['зима', 'весна', 'лето', 'осень', 'зима']
month = int(input('Введите номер месяца\n:'))

print(seasons_list[month//3])

#решение через  dict
seasons_dict = {'зима': (1, 2, 12), 'весна': (3, 4, 5), 'лето': (6, 7, 8), 'осень': (9, 10, 11)}

month = int(input('Введите номер месяца\n:'))

for key, value in seasons_dict.items():
    if month in value:
        print(key)